In [12]:
import numpy as np
import pandas as pd
np.random.seed(0)
df = pd.DataFrame({'state': ['CA', 'WA', 'CO', 'AZ'] * 3,
                   'office_id': list(range(1, 7)) * 2,
                   'sales': [np.random.randint(100000, 999999)
                             for _ in range(12)]})

In [13]:
state_office = df.groupby(['state', 'office_id']).agg({'sales': 'sum'})
state_office

                  sales
state office_id
AZ    2          222579
      4          252315
      6          835831
CA    1          405711
      3          710581
      5          982371
CO    1          404137
      3          217952
      5          474564
WA    2          535829
      4          548242
      6          459783

In [14]:
state_pcts = state_office.groupby(level=0).apply(lambda x: 100* x / float(x.sum()))

In [15]:
state_pcts

                     sales
state office_id
AZ    2          16.981365
      4          19.250033
      6          63.768601
CA    1          19.331879
      3          33.858747
      5          46.809373
CO    1          36.851857
      3          19.874290
      5          43.273852
WA    2          34.707233
      4          35.511259
      6          29.781508

In [17]:
state_pcts.unstack()

               sales
office_id          1          2          3          4          5          6
state
AZ               NaN  16.981365        NaN  19.250033        NaN  63.768601
CA         19.331879        NaN  33.858747        NaN  46.809373        NaN
CO         36.851857        NaN  19.874290        NaN  43.273852        NaN
WA               NaN  34.707233        NaN  35.511259        NaN  29.781508

In [18]:
pd.merge()

TypeError: merge() missing 2 required positional arguments: 'left' and 'right'

In [3]:
df['state']

0     CA
1     WA
2     CO
3     AZ
4     CA
5     WA
6     CO
7     AZ
8     CA
9     WA
10    CO
11    AZ
Name: state, dtype: object

In [4]:
df['sales']

0     405711
1     535829
2     217952
3     252315
4     982371
5     459783
6     404137
7     222579
8     710581
9     548242
10    474564
11    835831
Name: sales, dtype: int64

In [9]:
df.groupby['state']

TypeError: 'method' object is not subscriptable